app/controllers/gigs_controller.rb

SELECT COUNT(*) FROM "gigs"
SELECT "users".* FROM "users"
---
  def index
    @gigs = Gig.all.order_list(params[:sort_by]).page(params[:page]).per(12)
    @users = User.all

SELECT  "gigs".* FROM "gigs" WHERE "gigs"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT  "proposals".* FROM "proposals" WHERE "proposals"."id" = ? ORDER BY "proposals"."id" ASC LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT  "users".* FROM "users" WHERE "users"."id" = ? ORDER BY "users"."id" ASC LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def show
    @gig = Gig.find(params[:id])
    @proposals = @gig.proposals.order("created_at DESC").joins(:user)
    @awarded_proposal = Proposal.where(id: @gig.awarded_proposal).first

INSERT INTO "gigs" ("name", "description", "budget", "location", "latitude", "longitude", "created_at", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?)
---
  def create
    @gig = Gig.new(gig_params)
    @gig.user = current_user
    if @gig.save

SELECT  "gigs".* FROM "gigs" WHERE "gigs"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "gigs" SET "awarded_proposal" = ?, "updated_at" = ? WHERE "gigs"."id" = ?  [["awarded_proposal", 1], ["updated_at", 2017-06-03 06:51:21 UTC], ["id", 1]]
---
  def update
    @gig = Gig.find(params[:id])
    if current_user == @gig.user
      @gig.update(gig_params)

SELECT "categories".* FROM "categories"
SELECT COUNT(*) FROM "gigs" WHERE (name like '%hantar barang%' or description like'%hantar barang%')
---
  def search
    if params[:category].blank? && params[:search].blank?
      @gigs = Gig.all.order("created_at desc").page(params[:page]).per(12)

SELECT "gigs".* FROM "gigs" WHERE "gigs"."user_id" = 2 ORDER BY created_at desc
---
  def mygigs
    @gigs = Gig.where(user_id: current_user).order("created_at desc")