app/views/gigs/_gig_form.html.erb

SELECT "categories".* FROM "categories"
---
            <%= f.label :category_id %>
            <%= f.select :category_id, options_from_collection_for_select(Category.all, :id, :name), {}, class: "form-control input-lg" %>