app/views/gigs/search.html.erb

SELECT "categories".* FROM "categories"
---
          <label>Category</label>
          <%= select_tag :category, options_from_collection_for_select(Category.all, :id, :name), class: "form-control input-lg" %>