app/views/gigs/show.html.erb

      <ul>
        <% @gig.skills.each do |skill| %>
---
SELECT "skills".* FROM "skills" INNER JOIN "abilities" ON "skills"."id" = "abilities"."skill_id" WHERE "abilities"."gig_id" = ?  [["gig_id", 1]]

                </div>
                <% if current_user == @gig.user && @gig.awarded_proposal.blank? %>
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? ORDER BY "users"."id" ASC LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT "proposals".* FROM "proposals" WHERE "proposals"."gig_id" = ? ORDER BY created_at DESC  [["gig_id", 1]]