app/views/layouts/_gig_listings.html.erb

SELECT "categories".* FROM "categories"
---
          <label>Category</label>
          <%= select_tag :category, options_from_collection_for_select(Category.all, :id, :name), class: "form-control input-lg" %>

SELECT "skills".* FROM "skills" INNER JOIN "abilities" ON "skills"."id" = "abilities"."skill_id" WHERE "abilities"."gig_id" = ?  [["gig_id", 1]]
---
              <p><%= h truncate(gig.description, length: 500) %></p>
              <p>Skills: <%= gig.skills.map { |s| s.name }.join(", ") %></p>